## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.sentinel_service will be updated in-place
  ~ resource "aws_ecs_service" "sentinel_service" {
        id                                 = "arn:aws:ecs:eu-west-1:608859220822:service/sentinel-cluster/sentinel-service"
        name                               = "sentinel-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:25" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sentinel_task must be replaced
-/+ resource "aws_ecs_task_definition" "sentinel_task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:608859220822:task-definition/sentinel-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                    name             = "sentinel-container"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (6 unchanged attributes hidden)
                },
            ]
        )
      ~ id                       = "sentinel-task" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "sentinel-efs" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0118752d3a059d765" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-01569aadbf52f98b5" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume { # forces replacement
          + name = "sentinel-efs"

          + efs_volume_configuration {
              + file_system_id          = "fs-0118752d3a059d765"
              + root_directory          = "data"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-01569aadbf52f98b5"
                  + iam             = "ENABLED"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>